#### Outcome: 🟨  add=0 change=1 destroy=0
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```\n
TALOSCONFIG not found and TALOSCONFIG_TEXT not defined
Using KUBECONFIG_TEXT to create /tmp/talosconfig
[32m[1mSuccess![0m The configuration is valid.[0m
```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff
TALOSCONFIG not found and TALOSCONFIG_TEXT not defined
Using KUBECONFIG_TEXT to create /tmp/talosconfig

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

# # helm_release.cilium will be updated in-place
! ~ resource "helm_release" "cilium" {
!     ~ id                         = "cilium" -> (known after apply)
!     ~ metadata                   = {
!         ~ app_version    = "1.19.0-pre.3" -> (known after apply)
!         ~ chart          = "cilium" -> (known after apply)
!         ~ first_deployed = 1767198297 -> (known after apply)
!         ~ last_deployed  = 1767199136 -> (known after apply)
!         ~ name           = "cilium" -> (known after apply)
!         ~ namespace      = "kube-system" -> (known after apply)
!         ~ notes          = <<-EOT
+               You have successfully installed Cilium with Hubble Relay and Hubble UI.
+               
+               Your release version is 1.19.0-pre.3.
+               
+               For any further help, visit https://docs.cilium.io/en/v1.19/gettinghelp
+           EOT -> (known after apply)
!         ~ revision       = 2 -> (known after apply)
!         ~ values         = jsonencode(
+               {
-                 - cgroup                = {
-                     - autoMount = {
-                         - enabled = false
+                       }
-                     - hostRoot  = "/sys/fs/cgroup"
+                   }
-                 - enableIPv6Masquerade  = false
-                 - gatewayAPI            = {
-                     - enabled      = true
-                     - gatewayClass = {
-                         - create = "true"
+                       }
+                   }
-                 - hubble                = {
-                     - relay = {
-                         - enabled     = true
-                         - tolerations = [
-                             - {
-                                 - effect   = "NoSchedule"
-                                 - key      = "node-role.kubernetes.io/control-plane"
-                                 - operator = "Exists"
+                               },
+                           ]
+                       }
-                     - ui    = {
-                         - enabled     = true
-                         - tolerations = [
-                             - {
-                                 - effect   = "NoSchedule"
-                                 - key      = "node-role.kubernetes.io/control-plane"
-                                 - operator = "Exists"
+                               },
+                           ]
+                       }
+                   }
-                 - ipam                  = {
-                     - mode     = "kubernetes"
-                     - operator = {
-                         - clusterPoolIPv6PodCIDRList = [
-                             - "2a12:bec4:1821:3ed:bad1:c0de:100:0/112",
+                           ]
+                       }
+                   }
-                 - ipv4                  = {
-                     - enabled = false
+                   }
-                 - ipv6                  = {
-                     - enabled = true
+                   }
-                 - ipv6NativeRoutingCIDR = "(sensitive value)"
-                 - k8sClientRateLimit    = {
-                     - burst = 40
-                     - qps   = 20
+                   }
-                 - k8sServiceHost        = "(sensitive value)"
-                 - k8sServicePort        = 6443
-                 - kubeProxyReplacement  = true
-                 - l2announcements       = {
-                     - enabled = true
+                   }
-                 - loadBalancer          = {
-                     - dsrDispatch = "opt"
-                     - mode        = "dsr"
+                   }
-                 - operator              = {
-                     - replicas = 1
+                   }
-                 - policyEnforcementMode = "always"
-                 - routingMode           = "native"
-                 - securityContext       = {
-                     - capabilities = {
-                         - ciliumAgent      = [
-                             - "CHOWN",
-                             - "KILL",
-                             - "NET_ADMIN",
-                             - "NET_RAW",
-                             - "IPC_LOCK",
-                             - "SYS_ADMIN",
-                             - "SYS_RESOURCE",
-                             - "DAC_OVERRIDE",
-                             - "FOWNER",
-                             - "SETGID",
-                             - "SETUID",
+                           ]
-                         - cleanCiliumState = [
-                             - "NET_ADMIN",
-                             - "SYS_ADMIN",
-                             - "SYS_RESOURCE",
+                           ]
+                       }
+                   }
+               }
+           ) -> (known after apply)
!         ~ version        = "1.19.0-pre.3" -> (known after apply)
+       } -> (known after apply)
+       name                       = "cilium"
!     ~ version                    = "1.19.0-pre.3" -> "1.19.0-pre.4"
#       # (32 unchanged attributes hidden)
+   }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>

*Pusher: @rk-rosie-bot[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Full CI/CD Pipeline`*`;
<!-- Sticky Pull Request Commentdevelopment-k8s -->